// DataQR-API.cpp : Программа кодирует полученные данные в QR код, который возвращает клиенту.
// 
// Функционал сервера:
// /register      - регистрация пользователей
//     email
//     password
//     access layer (уровень доступа пользователя)
// /login         - авторизация пользователей
// /profile       - информация о текущем авторизованном пользователе
// /encode        - кодирование строки
// /decode        - раскодирование строки
// /organizations - список организаций
// /set_access    - изменение уровеня доступа пользователя (для админов)
// 


#include <iostream>


int main()
{


    return 0;
}
